[
  {
    "id": "portfolio-live",
    "title": "My Portfolio is Live: Here's What I Learned",
    "excerpt": "After building this portfolio from scratch with Next.js and shadcn/ui, here are the key lessons I learned about modern web development and what's coming next.",
    "date": "December 15, 2024",
    "readTime": "4 min read",
    "tags": ["Next.js", "Portfolio", "Shadcn UI", "TailwindCSS", "Web Development"],
    "content": "\n# My Portfolio is Live: Here's What I Learned\n\nBuilding this portfolio has been quite the journey! From choosing the tech stack to implementing features like the blog system and contact forms, every step taught me something new about modern web development.\n\n## Why I Built This\n\nAs a developer from Sydney, I wanted to create something that truly represents my skills and personality. Not just another template-based portfolio, but a custom-built site that showcases what I can do with modern technologies.\n\n## Tech Stack Decisions\n\n### Next.js 15 with App Router\nI chose Next.js for its excellent developer experience and performance optimizations. The new App Router made structuring the site intuitive, and server components helped with initial load times.\n\n### Shadcn/UI + TailwindCSS\nThis combination was a game-changer. Shadcn/UI provided beautiful, accessible components while TailwindCSS gave me the flexibility to customize everything exactly how I wanted it.\n\n### TypeScript Throughout\nType safety was crucial for maintainability. It caught so many potential bugs during development and made refactoring much more confident.\n\n## Key Features I Built\n\n### Responsive Navigation\nCreated a header component that adapts between desktop text navigation and mobile emoji navigation. The emoji approach makes mobile navigation fun and unique!\n\n### Contact Form with Email Integration\nImplemented a working contact form using Resend for email delivery. It includes proper validation, loading states, and user feedback.\n\n### Blog System\nBuilt a complete blog system from scratch with:\n- Search functionality\n- Tag filtering\n- Responsive design\n- Markdown content support\n\n### Smooth Scrolling\nGetting smooth scrolling to work properly across all browsers was trickier than expected, but worth it for the polished feel.\n\n## Challenges I Faced\n\n### Scroll Behavior Issues\nThe CSS scroll-behavior: smooth wasn't working consistently. Had to implement multiple approaches including JavaScript fallbacks and proper scroll padding for the sticky header.\n\n### Component Architecture\nDeciding how to structure reusable components, especially the header with different variants for different pages, required careful planning.\n\n### Content Organization\nStructuring the blog data and helper functions in a maintainable way was crucial. Ended up with a clean separation between data, types, and utilities.\n\n## What I Learned\n\n### Modern CSS is Powerful\nTailwindCSS combined with modern CSS features like CSS custom properties made styling incredibly efficient and maintainable.\n\n### Component Reusability Matters\nBuilding components like the site header with different variants saved tons of code duplication and made updates much easier.\n\n### Performance from the Start\nUsing Next.js Image components, proper caching headers, and optimized fonts made a huge difference in load times.\n\n### User Experience Details\nSmall touches like hover states, loading indicators, and proper error handling make the difference between a good site and a great one.\n\n## What's Next\n\nI'm planning to add:\n- Dark mode toggle (because who doesn't love dark mode?)\n- More interactive animations\n- Project case studies with detailed breakdowns\n- Maybe an AI chatbot to answer questions about my work\n\n## Thoughts on the Journey\n\nBuilding this portfolio reminded me why I love web development. Every problem has multiple solutions, and the satisfaction of seeing everything come together is incredible.\n\nThe best part? This isn't just a portfolio - it's a testament to continuous learning and improvement. Every feature I added taught me something new about React, Next.js, or modern web development practices.\n\nThanks for checking it out! Feel free to explore the code on GitHub or reach out if you have any questions about the implementation.\n\n— Melvin\n    "
  },
  {
    "id": "hello-world",
    "title": "Hello World!",
    "excerpt": "Testing out my new blog system built with Next.js and TypeScript. Time to see if all those components and helper functions actually work!",
    "date": "December 1, 2024",
    "readTime": "2 min read",
    "tags": ["Blog", "Hello World", "Next.js", "Testing"],
    "content": "\n# Hello World!\n\nWelcome to my blog! This is my first post, and honestly, I'm just testing to make sure everything works as expected.\n\n## What Am I Testing?\n\nBuilding this blog system from scratch means I need to verify:\n- Markdown rendering works properly\n- The search functionality can find this post\n- Tags are displaying correctly\n- The responsive design looks good on mobile\n\n## About This Blog\n\nI'll be writing about:\n- **Web Development**: Sharing what I learn building projects\n- **Tech Experiences**: Honest thoughts on tools and frameworks\n- **Project Updates**: Behind-the-scenes of what I'm working on\n- **Random Thoughts**: Because sometimes you just need to write\n\n## Testing Some Markdown\n\nLet's make sure the styling works:\n\n### Code Blocks\n```javascript\nfunction testBlog() {\n  console.log(\"Hello from my new blog!\");\n  return \"Success! 🎉\";\n}\n```\n\n### Lists\nThings I'm excited to write about:\n- Next.js 15 features\n- Building reusable components\n- TypeScript tips and tricks\n- Portfolio development journey\n\n### Links\nCheck out my [GitHub](https://github.com) for the source code of this site!\n\n## What's Coming Next\n\nI'm planning to write about:\n1. Building this portfolio from scratch\n2. Lessons learned with Next.js App Router\n3. Why I chose shadcn/ui over other component libraries\n4. The challenges of making responsive navigation\n\n## Quick Personal Note\n\nI'm Melvin, a full-stack developer from Sydney who loves building things with modern web technologies. When I'm not coding, you'll probably find me exploring Sydney's coffee scene or planning my next adventure.\n\nThis blog is part of my portfolio site, built to share my experiences and hopefully help other developers along the way.\n\nThanks for stopping by! More substantial content coming soon.\n\n— Melvin\n    "
  }
]